<template>
  <div id="scroll-board">
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  name: 'ScrollBoard',
  data() {
    return {
      config: {
        header: ['合同单号', '货号/批次/单号', '客户', '送货日期', '车牌号', '司机', '运载量', '运输状态', '装货地点', '卸货地点', '日常养护', '尺寸规格'],
        data: [
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
          ['2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx', '2019-07-01 19:25:00', '路面危害-松散', '5', 'xxxxxxx'],
        ],
        index: true,
        columnWidth: [50],
        align: ['left'],
        rowNum: 7,
        headerBGC: '#1981f6',
        headerHeight: 45,
        oddRowBGC: 'rgba(0, 44, 81, 0.8)',
        evenRowBGC: 'rgba(10, 29, 50, 0.8)'
      }
    }
  }
}
</script>

<style lang="less">
#scroll-board {
  width: 100%;
  box-sizing: border-box;
  margin-left: 20px;
  height: 100%;
  overflow: hidden;
}
</style>
